results/test_example/fio-example-p1-8.log
Starting FIO benchmark on pod 8...
FIO Configuration:
[global]
ioengine=libaio
direct=1
size=1G
runtime=300
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=2
iodepth=32

[test-example-phase1]
rw=randrw
rwmixread=70
bs=4k
# 100 IOPS per pod / 2 threads = 50 IOPS per thread
rate_iops=350,150
---
test-example-phase1: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
...
fio-3.41
Starting 2 processes

test-example-phase1: (groupid=0, jobs=2): err= 0: pid=12: Wed Mar 11 17:13:23 2026
  read: IOPS=699, BW=2800KiB/s (2867kB/s)(820MiB/300002msec)
    slat (nsec): min=1570, max=473182k, avg=33275.35, stdev=1084343.64
    clat (usec): min=3, max=1010.5k, avg=2433.86, stdev=23772.89
     lat (usec): min=133, max=1010.5k, avg=2467.13, stdev=23802.01
    clat percentiles (usec):
     |  1.00th=[   155],  5.00th=[   184], 10.00th=[   198], 20.00th=[   219],
     | 30.00th=[   237], 40.00th=[   255], 50.00th=[   273], 60.00th=[   297],
     | 70.00th=[   326], 80.00th=[   400], 90.00th=[  2147], 95.00th=[  5997],
     | 99.00th=[ 20841], 99.50th=[ 51119], 99.90th=[442500], 99.95th=[566232],
     | 99.99th=[692061]
   bw (  KiB/s): min=   59, max=14760, per=100.00%, avg=2803.02, stdev=345.59, samples=1198
   iops        : min=   14, max= 3690, avg=700.60, stdev=86.40, samples=1198
  write: IOPS=299, BW=1200KiB/s (1229kB/s)(352MiB/300002msec); 0 zone resets
    slat (usec): min=2, max=479158, avg=31.50, stdev=1604.27
    clat (usec): min=3, max=1015.5k, avg=2188.42, stdev=23775.30
     lat (usec): min=77, max=1015.5k, avg=2219.92, stdev=23900.42
    clat percentiles (usec):
     |  1.00th=[   124],  5.00th=[   145], 10.00th=[   155], 20.00th=[   174],
     | 30.00th=[   188], 40.00th=[   200], 50.00th=[   215], 60.00th=[   233],
     | 70.00th=[   255], 80.00th=[   289], 90.00th=[   424], 95.00th=[  4293],
     | 99.00th=[ 19268], 99.50th=[ 51119], 99.90th=[442500], 99.95th=[566232],
     | 99.99th=[692061]
   bw (  KiB/s): min=   84, max= 6200, per=100.00%, avg=1202.34, stdev=146.76, samples=1197
   iops        : min=   21, max= 1550, avg=300.50, stdev=36.69, samples=1197
  lat (usec)   : 4=0.01%, 10=0.03%, 20=0.01%, 50=0.02%, 100=0.08%
  lat (usec)   : 250=46.63%, 500=38.78%, 750=1.80%, 1000=0.99%
  lat (msec)   : 2=2.59%, 4=2.75%, 10=3.49%, 20=1.83%, 50=0.49%
  lat (msec)   : 100=0.11%, 250=0.20%, 500=0.15%, 750=0.06%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=1.07%, sys=3.03%, ctx=509614, majf=0, minf=30
  IO depths    : 1=79.8%, 2=15.3%, 4=1.8%, 8=0.1%, 16=0.1%, 32=2.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=210000,90000,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=2800KiB/s (2867kB/s), 2800KiB/s-2800KiB/s (2867kB/s-2867kB/s), io=820MiB (860MB), run=300002-300002msec
  WRITE: bw=1200KiB/s (1229kB/s), 1200KiB/s-1200KiB/s (1229kB/s-1229kB/s), io=352MiB (369MB), run=300002-300002msec

Disk stats (read/write):
  sdd: ios=2292055/1132867, sectors=20358496/15293136, merge=0/4635, ticks=5070376/2573010, in_queue=7658138, util=90.24%
FIO benchmark completed on pod 8